results/cpu-vs-latency3/memcached/6-2/nsl202.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2195590 ops,   72769 (avg:   73186) ops/sec, 2.74MB/sec (avg: 2.76MB/sec),  0.33 (avg:  0.32) msec latency

4         Threads
6         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        6653.71          ---          ---      0.32700       493.22
Gets       66532.39     29233.84     37298.55      0.32400      2333.12
Totals     73186.10     29233.84     37298.55      0.32400      2826.34


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.058      0.00005
GET       0.059      0.00020
GET       0.061      0.00025
GET       0.062      0.00030
GET       0.063      0.00035
GET       0.064      0.00045
GET       0.065      0.00100
GET       0.066      0.00150
GET       0.067      0.00200
GET       0.068      0.00271
GET       0.069      0.00346
GET       0.070      0.00486
GET       0.071      0.00621
GET       0.072      0.00782
GET       0.073      0.01047
GET       0.074      0.01323
GET       0.075      0.01658
GET       0.076      0.02039
GET       0.077      0.02480
GET       0.078      0.02951
GET       0.079      0.03577
GET       0.080      0.04369
GET       0.081      0.05301
GET       0.082      0.06448
GET       0.083      0.07736
GET       0.084      0.09344
GET       0.085      0.11418
GET       0.086      0.13778
GET       0.087      0.16959
GET       0.088      0.21062
GET       0.089      0.25897
GET       0.090      0.32069
GET       0.091      0.39349
GET       0.092      0.47992
GET       0.093      0.57786
GET       0.094      0.70382
GET       0.095      0.85101
GET       0.096      1.00562
GET       0.097      1.15357
GET       0.098      1.29786
GET       0.099      1.44225
GET       0.100      2.12918
GET       0.110      3.10319
GET       0.120      3.75565
GET       0.130      4.41062
GET       0.140      5.94390
GET       0.150      7.50820
GET       0.160      8.45140
GET       0.170      9.38382
GET       0.180     10.99737
GET       0.190     15.39726
GET       0.200     21.90896
GET       0.210     28.31098
GET       0.220     34.91717
GET       0.230     42.99261
GET       0.240     54.79334
GET       0.250     64.12621
GET       0.260     69.59936
GET       0.270     72.96949
GET       0.280     75.34372
GET       0.290     77.11803
GET       0.300     78.20692
GET       0.310     78.87572
GET       0.320     79.41490
GET       0.330     79.98204
GET       0.340     80.71722
GET       0.350     81.59754
GET       0.360     82.59460
GET       0.370     83.71014
GET       0.380     84.94803
GET       0.390     86.29058
GET       0.400     87.56279
GET       0.410     88.67147
GET       0.420     89.58841
GET       0.430     90.33792
GET       0.440     90.92931
GET       0.450     91.34640
GET       0.460     91.63678
GET       0.470     91.82987
GET       0.480     91.95417
GET       0.490     92.03729
GET       0.500     92.09270
GET       0.510     92.13027
GET       0.520     92.15643
GET       0.530     92.17587
GET       0.540     92.19170
GET       0.550     92.20738
GET       0.560     92.22071
GET       0.570     92.23433
GET       0.580     92.24876
GET       0.590     92.26520
GET       0.600     92.28338
GET       0.610     92.30257
GET       0.620     92.32311
GET       0.630     92.34736
GET       0.640     92.37717
GET       0.650     92.40498
GET       0.660     92.43699
GET       0.670     92.46805
GET       0.680     92.50087
GET       0.690     92.53544
GET       0.700     92.56440
GET       0.710     92.59351
GET       0.720     92.62156
GET       0.730     92.64992
GET       0.740     92.67542
GET       0.750     92.69942
GET       0.760     92.72131
GET       0.770     92.74020
GET       0.780     92.75909
GET       0.790     92.77442
GET       0.800     92.78850
GET       0.810     92.80187
GET       0.820     92.81415
GET       0.830     92.82587
GET       0.840     92.83614
GET       0.850     92.84526
GET       0.860     92.85508
GET       0.870     92.86470
GET       0.880     92.87542
GET       0.890     92.88454
GET       0.900     92.89531
GET       0.910     92.90689
GET       0.920     92.92006
GET       0.930     92.93494
GET       0.940     92.95253
GET       0.950     92.97252
GET       0.960     92.99541
GET       0.970     93.02402
GET       0.980     93.05719
GET       0.990     93.09637
GET       1.000     93.42568
GET       1.100     94.71858
GET       1.200     96.88023
GET       1.300     98.50404
GET       1.400     99.27063
GET       1.500     99.48516
GET       1.600     99.52675
GET       1.700     99.53346
GET       1.800     99.53587
GET       1.900     99.54188
GET       2.000     99.55656
GET       2.100     99.58812
GET       2.200     99.65050
GET       2.300     99.74183
GET       2.400     99.83908
GET       2.500     99.91453
GET       2.600     99.96463
GET       2.700     99.98722
GET       2.800     99.99604
GET       2.900     99.99870
GET       3.000     99.99905
GET       3.100     99.99925
GET       3.200     99.99945
GET       3.300     99.99965
GET       3.400     99.99970
GET       3.600     99.99980
GET       3.700     99.99995
GET       3.800    100.00000